# Getting start with ML at Coursera

* This is a simple Markdown

In [36]:
import pandas as pd
import matplotlib.pyplot as plt

# Getting start with Pandas

In [22]:
person = pd.read_csv('people-example.csv')

In [28]:
pd.DataFrame(person) # Is tha samething than use >>>>> graphlab.SFrame()

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [31]:
# Show a first elements of the csv file
person.head() # Or To show the last lines >>>>> person.tail()

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23

In [33]:
# To show data of any structure 
person.describe() # Or use person.show() in GraphLab Create

             age
count   7.000000
mean   23.142857
std     1.069045
min    22.000000
25%    22.500000
50%    23.000000
75%    23.500000
max    25.000000

In [34]:
pd.DataFrame(person).describe() # Other way to show datas

             age
count   7.000000
mean   23.142857
std     1.069045
min    22.000000
25%    22.500000
50%    23.000000
75%    23.500000
max    25.000000

In [56]:
person['First Name'] # show all elements of one especific column

0        Bob
1      Alice
2    Malcolm
3      Felix
4       Alex
5        Tod
6      Derek
Name: First Name, dtype: object

In [53]:
pd.DataFrame.count(person) # Count Elements of the column

First Name    7
Last Name     7
Country       7
age           7
dtype: int64

In [59]:
person['age'].mean() # Get the mean of the column

23.142857142857142

In [60]:
person['age'].max() # Max value

25

In [61]:
person['age'].min() # min value

22

# Create new columns

In [64]:
person['Full Name'] = person['First Name'] + ' ' + person['Last Name'] # Create new column

In [66]:
pd.DataFrame(person)

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [67]:
person['age'] + 2 # Sum 2 with all elements

0    26
1    25
2    24
3    25
4    25
5    24
6    27
Name: age, dtype: int64

# How to use apply function to to Transformation of our data

In [68]:
person['Country'].describe()

count                 7
unique                6
top       United States
freq                  2
dtype: object

In [75]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [78]:
person['Country'].apply(transform_country) # Calling a function and interate in all elements

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [80]:
person['Country'] = person['Country'].apply(transform_country) # Applaying my changes

In [81]:
person

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward